tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "int128/kubelogin"
tap "ngrok/ngrok"
brew "giflib"
brew "libpng"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "automake"
brew "bat"
brew "bison"
brew "glib"
brew "pixman"
brew "cairo"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "chruby"
brew "cmake"
brew "cmatrix"
brew "php"
brew "composer"
brew "deno"
brew "kubernetes-cli"
brew "devspace"
brew "fd"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "fnm"
brew "fnt"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "libheif"
brew "python@3.12"
brew "graphicsmagick"
brew "pkgconf"
brew "guile"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "libffi"
brew "libyaml"
brew "lua"
brew "tree-sitter"
brew "neovim"
brew "openblas"
brew "numpy"
brew "openvino"
brew "pandoc"
brew "pnpm", link: false
brew "python@3.11"
brew "python@3.13"
brew "python@3.14"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "yarn"
brew "int128/kubelogin/kubelogin"
cask "alt-tab"
cask "font-fira-code"
cask "ghostty"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "notunes"
cask "stats"
cask "visual-studio-code"
cask "vscodium"
cask "zed"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "actboy168.lua-debug"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "andenetalexander.vim-cheatsheet"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "circlecodesolution.ccs-flutter-color"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dtoplak.vscode-glsllint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ethansk.restore-terminals"
vscode "fill-labs.dependi"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "leetcode.vscode-leetcode"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "raczzalan.webgl-glsl-editor"
vscode "rust-lang.rust-analyzer"
vscode "slevesque.shader"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "typescriptteam.native-preview"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-postcss"
vscode "yrm.type-challenges"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
go "github.com/air-verse/air"
go "github.com/bootdotdev/bootdev"
go "golang.org/x/tools/gopls"
go "github.com/ottigan/hellogo"
go "github.com/ottigan/planning-poker"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
