tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "int128/kubelogin"
tap "ngrok/ngrok"
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "ansible"
brew "giflib"
brew "libpng"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "bison"
brew "glib"
brew "pixman"
brew "python@3.12"
brew "cairo"
brew "chruby"
brew "cmake"
brew "cmatrix"
brew "kubernetes-cli"
brew "devspace"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "gdbm"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "libheif"
brew "graphicsmagick"
brew "pkgconf"
brew "guile"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "libffi"
brew "librsvg"
brew "lua"
brew "node", link: false
brew "openblas"
brew "numpy"
brew "openvino"
brew "pnpm", link: false
brew "python@3.11"
brew "ripgrep"
brew "ruby-install"
brew "yarn"
brew "int128/kubelogin/kubelogin"
cask "alt-tab"
cask "font-fira-code"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "notunes"
cask "stats"
cask "visual-studio-code"
cask "zed"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "actboy168.lua-debug"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "andenetalexander.vim-cheatsheet"
vscode "beardedbear.beardedicons"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dtoplak.vscode-glsllint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "equinusocio.moxer-icons"
vscode "esbenp.prettier-vscode"
vscode "ethansk.restore-terminals"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "fill-labs.dependi"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "irongeek.vscode-env"
vscode "markosth09.color-picker"
vscode "miguelsolorio.fluent-icons"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "prisma.prisma"
vscode "raczzalan.webgl-glsl-editor"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sidneys1.gitconfig"
vscode "slevesque.shader"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-latvian"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "swellaby.rust-pack"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-postcss"
vscode "yandeu.five-server"
vscode "yoavbls.pretty-ts-errors"
vscode "yrm.type-challenges"
vscode "yy0931.gitconfig-lsp"
vscode "yzhang.markdown-all-in-one"
